input_openfoam/tutorials/heatTransfer/chtMultiRegionFoam/windshieldCondensation/0.orig/cabin/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0/cabin";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue           table
        (
            (0   (0 0 0))
            (60  (0 0 0))
            (61  (-2 0 0))
            (100 (-2 0 0))
        );
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    symmetry
    {
        type            symmetryPlane;
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    cabin_to_windshield
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
